In [1]:
#데이터 전처리

import numpy as np
import pandas as pd

raw_data={'first_name':['jason',np.nan,'Tina','Jake','Amy'],
         'last_name':['Miller', np.nan,'Ali','Milner','Cooze'],
         'age':[42,np.nan,36,24,73],
         'sex':['m',np.nan,'f','m','f'],
         'preTestScore':[4,np.nan,np.nan,2,3],
         'postTestScore':[25,np.nan,np.nan,62,70]}

df=pd.DataFrame(raw_data,columns=['first_name','last_name','age','sex','preTestScore','postTestScore'])
df

  first_name last_name   age  sex  preTestScore  postTestScore
0      jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [2]:
#결측치  비율 확인
df.isnull().sum() / len(df)

first_name       0.2
last_name        0.2
age              0.2
sex              0.2
preTestScore     0.4
postTestScore    0.4
dtype: float64

In [3]:
#결측치 처리 - 드롭(행 전체 삭제)
df.dropna()

  first_name last_name   age sex  preTestScore  postTestScore
0      jason    Miller  42.0   m           4.0           25.0
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [4]:
#모두 nan일때 드롭
df_cleaned=df.dropna(how='all')
df_cleaned

  first_name last_name   age sex  preTestScore  postTestScore
0      jason    Miller  42.0   m           4.0           25.0
2       Tina       Ali  36.0   f           NaN            NaN
3       Jake    Milner  24.0   m           2.0           62.0
4        Amy     Cooze  73.0   f           3.0           70.0

In [5]:
df['location']=np.nan
df.dropna(axis=1, how='all') # 열 기준 모두 nan인 열 드롭

  first_name last_name   age  sex  preTestScore  postTestScore
0      jason    Miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       Tina       Ali  36.0    f           NaN            NaN
3       Jake    Milner  24.0    m           2.0           62.0
4        Amy     Cooze  73.0    f           3.0           70.0

In [6]:
#thresh(최소 데이터 개수)
df.dropna(axis=0,thresh=1)

  first_name last_name   age sex  preTestScore  postTestScore  location
0      jason    Miller  42.0   m           4.0           25.0       NaN
2       Tina       Ali  36.0   f           NaN            NaN       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

In [7]:
df.dropna(thresh=5)

  first_name last_name   age sex  preTestScore  postTestScore  location
0      jason    Miller  42.0   m           4.0           25.0       NaN
3       Jake    Milner  24.0   m           2.0           62.0       NaN
4        Amy     Cooze  73.0   f           3.0           70.0       NaN

In [8]:
#결측치 처리 - 채우기
df.fillna(0)

  first_name last_name   age sex  preTestScore  postTestScore  location
0      jason    Miller  42.0   m           4.0           25.0       0.0
1          0         0   0.0   0           0.0            0.0       0.0
2       Tina       Ali  36.0   f           0.0            0.0       0.0
3       Jake    Milner  24.0   m           2.0           62.0       0.0
4        Amy     Cooze  73.0   f           3.0           70.0       0.0

In [9]:
#평균값으로 채우기, inplace=True 바꿔서 저장
df['preTestScore'].fillna(df['preTestScore'].mean(),inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           3.0            NaN       NaN
2       Tina       Ali  36.0    f           3.0            NaN       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [10]:
#성 별로 평균값 만들어서 대입
df.groupby("sex")['postTestScore'].transform('mean')

0    43.5
1     NaN
2    70.0
3    43.5
4    70.0
Name: postTestScore, dtype: float64

In [11]:
#평균값으로 대입하기
df['postTestScore'].fillna(df.groupby('sex')['postTestScore'].transform('mean'),inplace=True)
df

  first_name last_name   age  sex  preTestScore  postTestScore  location
0      jason    Miller  42.0    m           4.0           25.0       NaN
1        NaN       NaN   NaN  NaN           3.0            NaN       NaN
2       Tina       Ali  36.0    f           3.0           70.0       NaN
3       Jake    Milner  24.0    m           2.0           62.0       NaN
4        Amy     Cooze  73.0    f           3.0           70.0       NaN

In [13]:
edges=pd.DataFrame({'source':[0,1,2],'target':[2,2,3],'weight':[3,4,5],'color':['red','blue','blue']})
edges

   source  target  weight color
0       0       2       3   red
1       1       2       4  blue
2       2       3       5  blue

In [14]:
pd.get_dummies(edges)

   source  target  weight  color_blue  color_red
0       0       2       3           0          1
1       1       2       4           1          0
2       2       3       5           1          0

In [15]:
#시리즈 형태로 추출
pd.get_dummies(edges['color'])

   blue  red
0     0    1
1     1    0
2     1    0

In [16]:
#데이터 프레임 형태로 추출
pd.get_dummies(edges[["color"]])

   color_blue  color_red
0           0          1
1           1          0
2           1          0

In [18]:
weight_dict={3:'M',4:'L',5:'XL'}
edges['weight_sign']=edges['weight'].map(weight_dict)
weight_sign=pd.get_dummies(edges['weight_sign'])
weight_sign

   L  M  XL
0  0  1   0
1  1  0   0
2  0  0   1

In [19]:
#데이터 통합
pd.concat([edges,weight_sign],axis=1)

   source  target  weight color weight_sign  L  M  XL
0       0       2       3   red           M  0  1   0
1       1       2       4  blue           L  1  0   0
2       2       3       5  blue          XL  0  0   1

In [20]:
raw_data={'regiment':['Nighthawks','Nighthawks','Nighthawks','Nighthawks','Dragoons','Dragoons','Dragoons','Dragoons','Scouts','Scouts','Scouts','Scouts'],
         'company':['1st','1st','2nd','2nd','1st','1st','2nd','2nd','1st','1st','2nd','2nd'],
         'name':['Miller','Jacobson','Ali','Milner','Cooze','Jacon','Ryaner','Sone','Sloan','Piger','Riani','Ali'],
         'preTestScore':[4,24,31,2,3,4,24,31,2,3,2,3],
         'postTestScore':[25,94,57,62,70,25,94,57,62,70,62,70]}

df=pd.DataFrame(raw_data,columns=['regiment','company','name','preTestScore','postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

In [21]:
bins=[0,25,50,75,100]
group_names=['Low','Okay','Good','Great']
categories=[pd.cut(df['postTestScore'],bins,labels=group_names)]
categories

[0       Low
 1     Great
 2      Good
 3      Good
 4      Good
 5       Low
 6     Great
 7      Good
 8      Good
 9      Good
 10     Good
 11     Good
 Name: postTestScore, dtype: category
 Categories (4, object): ['Low' < 'Okay' < 'Good' < 'Great']]

In [22]:
df=pd.DataFrame({'A':[14.00,90.20,90.95,96.27,91.21],
                'B':[103.02,107.26,110.35,114.23,114.68],
                'C':['big','small','big','small','small']})

df

       A       B      C
0  14.00  103.02    big
1  90.20  107.26  small
2  90.95  110.35    big
3  96.27  114.23  small
4  91.21  114.68  small

In [23]:
df['A']-df['A'].min()

0     0.00
1    76.20
2    76.95
3    82.27
4    77.21
Name: A, dtype: float64

In [24]:
(df['A']-df['A'].min())/(df['A'].max()-df["A"].min())

0    0.000000
1    0.926219
2    0.935335
3    1.000000
4    0.938495
Name: A, dtype: float64

In [25]:
#z스코어 정규화
(df['B']-df['B'].mean())/(df['B'].std())

0   -1.405250
1   -0.540230
2    0.090174
3    0.881749
4    0.973556
Name: B, dtype: float64